MarlinFirmware/Marlin/Marlin/src/HAL/STM32F1/HAL.cpp
/**================================================================
 *        库函数: ADC复位
================================================================*/
void ADC_DeInit(ADC_Module* NS_ADCx)
{
    uint32_t reg_temp;

    if (NS_ADCx == NS_ADC1)
    {
        /* Enable ADC1 reset state */
        reg_temp = ADC_RCC_AHBPRST;
        reg_temp |= RCC_AHB_PERIPH_ADC1;
        ADC_RCC_AHBPRST = reg_temp;			          // ADC模块复位置位
        ADC_RCC_AHBPRST = 0x00000000;             // ADC模块复位清除
    }
    else if (NS_ADCx == NS_ADC2)
    {
        /* Enable ADC2 reset state */
        reg_temp = ADC_RCC_AHBPRST;
        reg_temp |= RCC_AHB_PERIPH_ADC2;
        ADC_RCC_AHBPRST = reg_temp;			          // ADC模块复位置位
        ADC_RCC_AHBPRST = 0x00000000;             // ADC模块复位清除
    }
    else if (NS_ADCx == NS_ADC3)
    {
        /* Enable ADC2 reset state */
        reg_temp = ADC_RCC_AHBPRST;
        reg_temp |= RCC_AHB_PERIPH_ADC3;
        ADC_RCC_AHBPRST = reg_temp;			          // ADC模块复位置位
        ADC_RCC_AHBPRST = 0x00000000;             // ADC模块复位清除
    }
    else if (NS_ADCx == NS_ADC4)
    {
        /* Enable ADC3 reset state */
        reg_temp = ADC_RCC_AHBPRST;
        reg_temp |= RCC_AHB_PERIPH_ADC4;
        ADC_RCC_AHBPRST = reg_temp;			          // ADC模块复位置位
        ADC_RCC_AHBPRST = 0x00000000;             // ADC模块复位清除
    }
}

/**================================================================
 *        库函数: ADC模块使能
================================================================*/
void ADC_Enable(ADC_Module* NS_ADCx, uint32_t Cmd)
{
    if (Cmd)
    {
        /* Set the AD_ON bit to wake up the ADC from power down mode */
        NS_ADCx->CTRL2 |= CTRL2_AD_ON_SET;
    }
    else
    {
        /* Disable the selected ADC peripheral */
        NS_ADCx->CTRL2 &= CTRL2_AD_ON_RESET;
    }
}

/**================================================================
 *        库函数: 获取ADC状态标志位
================================================================*/
uint32_t ADC_GetFlagStatusNew(ADC_Module* NS_ADCx, uint8_t ADC_FLAG_NEW)
{
    uint32_t bitstatus = 0;

    /* Check the status of the specified ADC flag */
    if ((NS_ADCx->CTRL3 & ADC_FLAG_NEW) != (uint8_t)0)
    {
        /* ADC_FLAG_NEW is set */
        bitstatus = 1;
    }
    else
    {
        /* ADC_FLAG_NEW is reset */
        bitstatus = 0;
    }
    /* Return the ADC_FLAG_NEW status */
    return bitstatus;
}

/**================================================================
 *        库函数: 开启ADC校准
================================================================*/
void ADC_StartCalibration(ADC_Module* NS_ADCx)
{
    /* Enable the selected ADC calibration process */
    if(NS_ADCx->CALFACT == 0)
        NS_ADCx->CTRL2 |= CTRL2_CAL_SET;
}

/**================================================================
 *        库函数: 使能ADC DMA
================================================================*/
void ADC_EnableDMA(ADC_Module* NS_ADCx, uint32_t Cmd)
{
    if (Cmd != 0)
    {
        /* Enable the selected ADC DMA request */
        NS_ADCx->CTRL2 |= CTRL2_DMA_SET;
    }
    else
    {
        /* Disable the selected ADC DMA request */
        NS_ADCx->CTRL2 &= CTRL2_DMA_RESET;
    }
}

/**================================================================
 *        库函数: 配置ADC中断使能
================================================================*/
void ADC_ConfigInt(ADC_Module* NS_ADCx, uint16_t ADC_IT, uint32_t Cmd)
{
    uint8_t itmask = 0;

    /* Get the ADC IT index */
    itmask = (uint8_t)ADC_IT;
    if (Cmd != 0)
    {
        /* Enable the selected ADC interrupts */
        NS_ADCx->CTRL1 |= itmask;
    }
    else
    {
        /* Disable the selected ADC interrupts */
        NS_ADCx->CTRL1 &= (~(uint32_t)itmask);
    }
}

/**================================================================
 *        库函数: 获取ADC校准状态
================================================================*/
uint32_t ADC_GetCalibrationStatus(ADC_Module* NS_ADCx)
{
    uint32_t bitstatus = 0;

    /* Check the status of CAL bit */
    if ((NS_ADCx->CTRL2 & CTRL2_CAL_SET) != (uint32_t)0)
    {
        /* CAL bit is set: calibration on going */
        bitstatus = 1;
    }
    else
    {
        /* CAL bit is reset: end of calibration */
        bitstatus = 0;
    }

    if(NS_ADCx->CALFACT != 0)
        bitstatus = 0;
    /* Return the CAL bit status */
    return bitstatus;
}

/**================================================================
 *        库函数: 配置ADC通道
================================================================*/
void ADC_ConfigRegularChannel(ADC_Module* NS_ADCx, uint8_t ADC_Channel, uint8_t Rank, uint8_t ADC_SampleTime)
{
    uint32_t tmpreg1 = 0, tmpreg2 = 0;

    if (ADC_Channel == ADC_CH_18)
    {
        tmpreg1 = NS_ADCx->SAMPT3;
        tmpreg1 &= (~0x00000007);
        tmpreg1 |= ADC_SampleTime;
        NS_ADCx->SAMPT3 = tmpreg1;
    }
    else if (ADC_Channel > ADC_CH_9) /* if ADC_CH_10 ... ADC_CH_17 is selected */
    {
        /* Get the old register value */
        tmpreg1 = NS_ADCx->SAMPT1;
        /* Calculate the mask to clear */
        tmpreg2 = SAMPT1_SMP_SET << (3 * (ADC_Channel - 10));
        /* Clear the old channel sample time */
        tmpreg1 &= ~tmpreg2;
        /* Calculate the mask to set */
        tmpreg2 = (uint32_t)ADC_SampleTime << (3 * (ADC_Channel - 10));
        /* Set the new channel sample time */
        tmpreg1 |= tmpreg2;
        /* Store the new register value */
        NS_ADCx->SAMPT1 = tmpreg1;
    }
    else /* ADC_Channel include in ADC_Channel_[0..9] */
    {
        /* Get the old register value */
        tmpreg1 = NS_ADCx->SAMPT2;
        /* Calculate the mask to clear */
        tmpreg2 = SAMPT2_SMP_SET << (3 * ADC_Channel);
        /* Clear the old channel sample time */
        tmpreg1 &= ~tmpreg2;
        /* Calculate the mask to set */
        tmpreg2 = (uint32_t)ADC_SampleTime << (3 * ADC_Channel);
        /* Set the new channel sample time */
        tmpreg1 |= tmpreg2;
        /* Store the new register value */
        NS_ADCx->SAMPT2 = tmpreg1;
    }
    /* For Rank 1 to 6 */
    if (Rank < 7)
    {
        /* Get the old register value */
        tmpreg1 = NS_ADCx->RSEQ3;
        /* Calculate the mask to clear */
        tmpreg2 = SQR3_SEQ_SET << (5 * (Rank - 1));
        /* Clear the old SQx bits for the selected rank */
        tmpreg1 &= ~tmpreg2;
        /* Calculate the mask to set */
        tmpreg2 = (uint32_t)ADC_Channel << (5 * (Rank - 1));
        /* Set the SQx bits for the selected rank */
        tmpreg1 |= tmpreg2;
        /* Store the new register value */
        NS_ADCx->RSEQ3 = tmpreg1;
    }
    /* For Rank 7 to 12 */
    else if (Rank < 13)
    {
        /* Get the old register value */
        tmpreg1 = NS_ADCx->RSEQ2;
        /* Calculate the mask to clear */
        tmpreg2 = SQR2_SEQ_SET << (5 * (Rank - 7));
        /* Clear the old SQx bits for the selected rank */
        tmpreg1 &= ~tmpreg2;
        /* Calculate the mask to set */
        tmpreg2 = (uint32_t)ADC_Channel << (5 * (Rank - 7));
        /* Set the SQx bits for the selected rank */
        tmpreg1 |= tmpreg2;
        /* Store the new register value */
        NS_ADCx->RSEQ2 = tmpreg1;
    }
    /* For Rank 13 to 16 */
    else
    {
        /* Get the old register value */
        tmpreg1 = NS_ADCx->RSEQ1;
        /* Calculate the mask to clear */
        tmpreg2 = SQR1_SEQ_SET << (5 * (Rank - 13));
        /* Clear the old SQx bits for the selected rank */
        tmpreg1 &= ~tmpreg2;
        /* Calculate the mask to set */
        tmpreg2 = (uint32_t)ADC_Channel << (5 * (Rank - 13));
        /* Set the SQx bits for the selected rank */
        tmpreg1 |= tmpreg2;
        /* Store the new register value */
        NS_ADCx->RSEQ1 = tmpreg1;
    }
}

