MarlinFirmware/Marlin/Marlin/src/HAL/STM32F1/HAL.cpp
}


/**====================================================================================================================================================================
 *        n32g452 - end
====================================================================================================================================================================*/





// ------------------------
// ADC
// ------------------------
// Init the AD in continuous capture mode


#define NS_PINRT(V...)       do{ SERIAL_ECHO_START(); SERIAL_ECHOLNPAIR(V); }while(0)

// ------------------------
// ADC
// ------------------------
// Init the AD in continuous capture mode
void MarlinHAL::adc_init()
{
  uint32_t reg_temp;

  // SERIAL_ECHO_MSG("\r\n n32g45x HAL_adc_init\r\n");

  /**  GPIO 设置 */
  reg_temp = ADC_RCC_APB2PCLKEN;
 	reg_temp |= 0x0f;                 //使能PORT口时钟
  ADC_RCC_APB2PCLKEN = reg_temp;

  // reg_temp = NS_GPIOC_PL_CFG;
  // reg_temp &= 0XFF00FFFF;
  // NS_GPIOC_PL_CFG = reg_temp;       // PC4/5 anolog输入

  enable_adc_clk(1);                // 使能ADC时钟
  ADC_DMA_init();                   // DMA初始化
  ADC_Initial(NS_ADC2);             // ADC初始化

  _delay_ms(2);
  // NS_PINRT("get adc1 = ", HAL_adc_results[0], "\r\n");
  // NS_PINRT("get adc2 = ", HAL_adc_results[1], "\r\n");
}

// void HAL_adc_init()
// {

//   SERIAL_ECHO_MSG("\r\n n32g45x luke \r\n");

//   // configure the ADC
//   adc.calibrate();
//   #if F_CPU > 72000000
//     adc.setSampleRate(ADC_SMPR_71_5); // 71.5 ADC cycles
//   #else
//     adc.setSampleRate(ADC_SMPR_41_5); // 41.5 ADC cycles
//   #endif
//   adc.setPins((uint8_t *)adc_pins, ADC_PIN_COUNT);
//   adc.setDMA(HAL_adc_results, (uint16_t)ADC_PIN_COUNT, (uint32_t)(DMA_MINC_MODE | DMA_CIRC_MODE), nullptr);
//   adc.setScanMode();
//   adc.setContinuous();
//   adc.startConversion();
// }

void MarlinHAL::adc_start(const pin_t pin) {
  #define __TCASE(N,I) case N: pin_index = I; break;
  #define _TCASE(C,N,I) TERN_(C, __TCASE(N, I))
  ADCIndex pin_index;
  switch (pin) {
    default: return;
    _TCASE(HAS_TEMP_ADC_0,        TEMP_0_PIN,                TEMP_0)
    _TCASE(HAS_TEMP_ADC_1,        TEMP_1_PIN,                TEMP_1)
    _TCASE(HAS_TEMP_ADC_2,        TEMP_2_PIN,                TEMP_2)
    _TCASE(HAS_TEMP_ADC_3,        TEMP_3_PIN,                TEMP_3)
    _TCASE(HAS_TEMP_ADC_4,        TEMP_4_PIN,                TEMP_4)
    _TCASE(HAS_TEMP_ADC_5,        TEMP_5_PIN,                TEMP_5)
    _TCASE(HAS_TEMP_ADC_6,        TEMP_6_PIN,                TEMP_6)
    _TCASE(HAS_TEMP_ADC_7,        TEMP_7_PIN,                TEMP_7)
    _TCASE(HAS_HEATED_BED,        TEMP_BED_PIN,              TEMP_BED)
    _TCASE(HAS_TEMP_CHAMBER,      TEMP_CHAMBER_PIN,          TEMP_CHAMBER)
    _TCASE(HAS_TEMP_ADC_PROBE,    TEMP_PROBE_PIN,            TEMP_PROBE)
    _TCASE(HAS_TEMP_COOLER,       TEMP_COOLER_PIN,           TEMP_COOLER)
    _TCASE(HAS_TEMP_BOARD,        TEMP_BOARD_PIN,            TEMP_BOARD)
    _TCASE(HAS_TEMP_SOC,          TEMP_SOC_PIN,              TEMP_SOC)
    _TCASE(HAS_JOY_ADC_X,         JOY_X_PIN,                 JOY_X)
    _TCASE(HAS_JOY_ADC_Y,         JOY_Y_PIN,                 JOY_Y)
    _TCASE(HAS_JOY_ADC_Z,         JOY_Z_PIN,                 JOY_Z)
    _TCASE(FILAMENT_WIDTH_SENSOR, FILWIDTH_PIN,              FILWIDTH)
    _TCASE(HAS_ADC_BUTTONS,       ADC_KEYPAD_PIN,            ADC_KEY)
    _TCASE(POWER_MONITOR_CURRENT, POWER_MONITOR_CURRENT_PIN, POWERMON_CURRENT)
    _TCASE(POWER_MONITOR_VOLTAGE, POWER_MONITOR_VOLTAGE_PIN, POWERMON_VOLTS)
  }
  adc_result = (adc_results[(int)pin_index] & 0xFFF) >> (12 - HAL_ADC_RESOLUTION); // shift out unused bits
}

uint16_t analogRead(pin_t pin) {
  const bool is_analog = _GET_MODE(pin) == GPIO_INPUT_ANALOG;
  return is_analog ? analogRead(uint8_t(pin)) : 0;
}

// Wrapper to maple unprotected analogWrite
void analogWrite(pin_t pin, int pwm_val8) {
  if (PWM_PIN(pin))
    analogWrite(uint8_t(pin), pwm_val8);
}

void MarlinHAL::reboot() { nvic_sys_reset(); }

void flashFirmware(const int16_t) { nvic_sys_reset(); }

#endif // VOXELAB_N32

#endif // __STM32F1__
